{
    "title": "Phytoplankton species classifier (VLIZ) ",
    "summary": "Identify the species level of Plankton for 95 classes. Working on OSCAR",
    "description": [
        "Phytoplankton species classifier is an application to classify phytoplankton, features DEEPaaS API.\n",
        "Provided by [VLIZ (Flanders Marine Institute)](https://www.vliz.be/nl)\n",
        "Plankton, though small, plays a critical role in marine ecosystems. Identifying plankton species is vital for understanding ecosystem health, predicting harmful algal blooms, and managing marine environments. The FlowCam, a technology capturing high-resolution images of plankton, coupled with artificial intelligence (AI), has revolutionized plankton identification. ",
        "FlowCam's ability to swiftly capture and analyze plankton images has transformed the once time-consuming process of identification. When integrated with AI, this technology can rapidly categorize and identify plankton species with remarkable accuracy, providing a comprehensive understanding of marine communities.",
        "The benefits are numerous: real-time monitoring of marine environments, early detection of changes, support for conservation efforts, and contributing valuable data for research and policy decisions. AI-driven plankton identification is a game-changer, offering a powerful tool for researchers.\n",
        " \n",
        "This Docker container contains a trained Convolutional Neural network optimized for phytoplankton identification using images. The architecture used is an Xception [1] network using Keras on top of Tensorflow.",
        "The PREDICT method expects an RGB image as input (or the URL of an RGB image) and will return a JSON with the top 5 predictions.\n",
        "As a training dataset, we have used a collection of images from [VLIZ](https://www.vliz.be/nl) which consists of 350K images from 95 classes of phytoplankton.\n",
        " \n",
        "Thanks to this module, the user has a couple of options:\n",
        "1) Users can use the existing model to predict phytoplankton species if it's part of one of our classes (see zenodo).\n",
        "2) Users can upload their own data (i.e., images and datasplit files) on Nextcloud and train their new CNN to predict new classes.\n",
        "3) Users can transform and augment their images to explore new type of models.\n",

        "<img class='fit', src='https://raw.githubusercontent.com/deephdc/UC-lifewatch-DEEP-OC-phyto-plankton-classification/master/images/plankton_img.png'/>\n",

        "**References**\n",
        "[1]: Yann LeCun, Yoshua Bengio, and Geofrey Hinton. [Deep learning](https://www.cs.toronto.edu/~hinton/absps/NatureDeepReview.pdf). Nature, 521(7553):436-444, May 2015.\n",

        "This module is largely based on the [existing image classifcation module](https://github.com/deephdc/image-classification-tf) made by [Ingacio Heredia](https://github.com/IgnacioHeredia)"
    ],
    "keywords": [
        "docker",
        "Tensorflow",
        "deep learning",
        "pre-trained",
        "trainable",
        "imagine classification",
        "api-v2",
	    "vo.imagine-ai.eu"
    ],
    "license": "MIT",
    "date_creation": "2023-08-10",
    "dataset_url": "https://zenodo.org/records/10554845",
    "sources": {
		"dockerfile_repo": "https://github.com/lifewatch/phyto-plankton-classification",
		"docker_registry_repo": "deephdc/uc-lifewatch-deep-oc-phyto-plankton-classification",
		"code": "https://github.com/lifewatch/phyto-plankton-classification"
	},
    "continuous_integration": {
        "build_status_badge": "https://jenkins.indigo-datacloud.eu/buildStatus/icon?job=Pipeline-as-code/DEEP-OC-org/UC-lifewatch-DEEP-OC-phyto-plankton-classification/master",
        "build_status_url": "https://jenkins.indigo-datacloud.eu/job/Pipeline-as-code/job/DEEP-OC-org/job/UC-lifewatch-DEEP-OC-phyto-plankton-classification/job/master"
    },
    "tosca": [
        {
            "title": "Mesos (CPU)",
            "url": "https://raw.githubusercontent.com/indigo-dc/tosca-templates/master/deep-oc/deep-oc-marathon-webdav.yml",
            "inputs": [
                "rclone_conf",
                "rclone_url",
                "rclone_vendor",
                "rclone_user",
                "rclone_pass"
            ]
        }
    ]
}